open-seneca/integrated-aq-sensor/Firmware/STM32L071RBT6/STM32L071RBT6.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32L0
ProjectManager.MainLocation=Core/Src
PH0-OSC_IN.Locked=true
I2C2.IPParameters=Timing,NoStretchMode
RCC.USART1Freq_Value=24000000
PH0-OSC_IN.Signal=RCC_OSC_IN
USART2.IPParameters=VirtualMode-Asynchronous,BaudRate,Mode
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32L071RBTx
SPI1.VirtualType=VM_MASTER
SPI2.VirtualType=VM_MASTER
PB10.Mode=I2C
USART1.BaudRate=9600
RCC.PLLCLKFreq_Value=24000000
PC5.Locked=true
I2C2.Timing=0x00506682
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_ADC_Init-ADC-false-HAL-true,4-MX_I2C1_Init-I2C1-false-HAL-true,5-MX_I2C2_Init-I2C2-false-HAL-true,6-MX_USART1_UART_Init-USART1-false-HAL-true,7-MX_USART2_UART_Init-USART2-false-HAL-true,8-MX_FATFS_Init-FATFS-false-HAL-false,9-MX_SPI1_Init-SPI1-false-HAL-true,10-MX_SPI2_Init-SPI2-false-HAL-true,11-MX_TIM2_Init-TIM2-false-HAL-true,12-MX_TIM3_Init-TIM3-false-HAL-true
I2C2.NoStretchMode=I2C_NOSTRETCH_DISABLE
RCC.RTCFreq_Value=37000
RCC.USART2Freq_Value=24000000
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USART1.IPParameters=VirtualMode-Asynchronous,BaudRate
PB11.Signal=I2C2_SDA
PB13.Signal=SPI2_SCK
PB15.Signal=SPI2_MOSI
PinOutPanel.RotationAngle=0
TIM3.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
SH.GPXTI2.0=GPIO_EXTI2
RCC.I2C3Freq_Value=24000000
Mcu.IP4=NVIC
RCC.FCLKCortexFreq_Value=24000000
Mcu.IP5=RCC
Mcu.IP2=I2C1
I2C1.IPParameters=Timing,NoStretchMode
Mcu.IP3=I2C2
PA15.GPIO_Label=SD_CS
Mcu.IP0=ADC
Mcu.IP1=FATFS
Mcu.UserConstants=
PA4.Mode=IN4
SH.S_TIM3_CH2.ConfNb=1
Mcu.ThirdPartyNb=0
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=24000000
Mcu.IPNb=13
TIM2.IPParameters=Channel-PWM Generation1 CH1,Prescaler,Period
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=24000000
TIM3.Period=100-1
PB6.Signal=I2C1_SCL
PB6.Mode=I2C
SPI1.CalculateBaudRate=375.0 KBits/s
PA8.GPIOParameters=GPIO_Label
Mcu.Pin6=PA3
Mcu.Pin7=PA4
Mcu.Pin8=PA5
Mcu.Pin9=PA6
RCC.AHBFreq_Value=24000000
PH0-OSC_IN.Mode=HSE-External-Oscillator
PB13.Locked=true
Mcu.Pin0=PH0-OSC_IN
Mcu.Pin1=PH1-OSC_OUT
TIM3.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC2
Mcu.Pin3=PA0
Mcu.Pin4=PA1
Mcu.Pin5=PA2
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=16000000
PB3.Mode=Full_Duplex_Master
PA8.Locked=true
PA4.Locked=true
Mcu.IP10=TIM3
USART2.VirtualMode-Asynchronous=VM_ASYNC
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP12=USART2
Mcu.IP11=USART1
PB12.GPIO_Label=SPI2_NCS
ProjectManager.FirmwarePackage=STM32Cube FW_L0 V1.12.0
MxDb.Version=DB.6.0.21
PB4.Mode=Full_Duplex_Master
I2C1.NoStretchMode=I2C_NOSTRETCH_DISABLE
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=16000000
PC4.GPIO_Label=GPS_PPS
PA14.Mode=Serial_Wire
PB14.Mode=Full_Duplex_Master
TIM3.Prescaler=3200-1
PB5.Mode=Full_Duplex_Master
File.Version=6
PA0.Mode=IN0
SPI2.CalculateBaudRate=12.0 MBits/s
PH1-OSC_OUT.Locked=true
SH.S_TIM2_CH1.ConfNb=1
PB7.Signal=I2C1_SDA
PB8.Locked=true
PA8.Signal=GPIO_Output
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.S_TIM3_CH1.0=TIM3_CH1,PWM Generation1 CH1
ProjectManager.HalAssertFull=false
PB0.Locked=true
ProjectManager.ProjectName=STM32L071RBT6
PA0.Signal=ADC_IN0
PH1-OSC_OUT.Mode=HSE-External-Oscillator
Mcu.Package=LQFP64
TIM2.Prescaler=3200-1
PB1.Signal=S_TIM3_CH4
PA6.Signal=S_TIM3_CH1
PA7.Locked=true
PA5.Locked=true
SPI2.Mode=SPI_MODE_MASTER
VP_FATFS_VS_Generic.Signal=FATFS_VS_Generic
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=37000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA10.Signal=USART1_RX
PA15.Signal=GPIO_Output
RCC.APB1TimFreq_Value=24000000
PC4.Locked=true
SPI2.Direction=SPI_DIRECTION_2LINES
PC5.Signal=GPIO_Output
PB13.Mode=Full_Duplex_Master
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_64
PC2.GPIO_Label=ACC_INT
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
RCC.LPTIMFreq_Value=24000000
PB15.Locked=true
PB3.Locked=true
PB4.Signal=SPI1_MISO
PA3.Signal=USART2_RX
RCC.TIMFreq_Value=24000000
RCC.MSI_VALUE=2097000
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
ProjectManager.ProjectFileName=STM32L071RBT6.ioc
SH.S_TIM2_CH1.0=TIM2_CH1,PWM Generation1 CH1
PB8.GPIOParameters=GPIO_Label
PA10.Mode=Asynchronous
PA15.GPIOParameters=GPIO_Label
Mcu.PinsNb=35
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
RCC.LPUARTFreq_Value=24000000
PC2.Signal=GPXTI2
PC4.Signal=GPIO_Input
ProjectManager.DefaultFWLocation=true
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB14.Locked=true
RCC.TimerFreq_Value=24000000
SH.S_TIM3_CH3.0=TIM3_CH3,PWM Generation3 CH3
NVIC.USART2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
USART2.BaudRate=9600
RCC.FamilyName=M
RCC.WatchDogFreq_Value=37000
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA13.Signal=SYS_SWDIO
PA3.Mode=Asynchronous
TIM3.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
RCC.HSI16_VALUE=16000000
PB8.GPIO_Label=TIM4_CH3
PA15.Locked=true
PA9.Mode=Asynchronous
PA8.GPIO_Label=BT_RESET
SH.GPXTI2.ConfNb=1
PB11.Mode=I2C
ProjectManager.TargetToolchain=STM32CubeIDE
SH.S_TIM3_CH3.ConfNb=1
PC5.GPIOParameters=GPIO_Label
PA9.Signal=USART1_TX
I2C1.Timing=0x00506682
PB5.Locked=true
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
PC2.Locked=true
ProjectManager.RegisterCallBack=
RCC.LSE_VALUE=32768
PA1.Signal=ADC_IN1
PB1.Locked=true
VP_FATFS_VS_Generic.Mode=User_defined
PB10.Signal=I2C2_SCL
PB14.Signal=SPI2_MISO
PA5.Signal=S_TIM2_CH1
SH.S_TIM3_CH2.0=TIM3_CH2,PWM Generation2 CH2
RCC.MCOPinFreq_Value=24000000
board=custom
RCC.VCOOutputFreq_Value=48000000
ProjectManager.LastFirmware=true
PB15.Mode=Full_Duplex_Master
RCC.APB2Freq_Value=24000000
PA1.Mode=IN1
MxCube.Version=6.2.1
RCC.I2C1Freq_Value=24000000
SPI1.Mode=SPI_MODE_MASTER
PC2.GPIOParameters=GPIO_Label
Mcu.Pin30=PB6
VP_SYS_VS_Systick.Mode=SysTick
Mcu.Pin33=VP_FATFS_VS_Generic
TIM3.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4,Prescaler,Period
PH1-OSC_OUT.Signal=RCC_OSC_OUT
Mcu.Pin34=VP_SYS_VS_Systick
Mcu.Pin31=PB7
Mcu.Pin32=PB8
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
TIM2.Period=100-1
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI16_VALUE,HSI_VALUE,I2C1Freq_Value,I2C3Freq_Value,LPTIMFreq_Value,LPUARTFreq_Value,LSE_VALUE,LSI_VALUE,MCOPinFreq_Value,MSI_VALUE,PLLCLKFreq_Value,PLLSourceVirtual,PWRFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TIMFreq_Value,TimerFreq_Value,USART1Freq_Value,USART2Freq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,WatchDogFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L071R(B-Z)Tx
Mcu.Pin26=PA15
Mcu.Pin27=PB3
RCC.RTCHSEDivFreq_Value=8000000
PA2.Signal=USART2_TX
Mcu.Pin24=PA13
ProjectManager.UnderRoot=true
Mcu.Pin25=PA14
Mcu.IP8=SYS
Mcu.IP9=TIM2
Mcu.Pin28=PB4
Mcu.IP6=SPI1
Mcu.Pin29=PB5
Mcu.IP7=SPI2
ProjectManager.CoupleFile=false
PB4.Locked=true
PB3.Signal=SPI1_SCK
PA4.Signal=ADC_IN4
RCC.SYSCLKFreq_VALUE=24000000
Mcu.Pin22=PA9
PB5.Signal=SPI1_MOSI
Mcu.Pin23=PA10
Mcu.Pin20=PB15
PA3.Locked=true
Mcu.Pin21=PA8
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PC5.GPIO_Label=GPS_NRST
PA13.Locked=true
ProjectManager.CompilerOptimize=6
PB7.Mode=I2C
PA14.Signal=SYS_SWCLK
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB10
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB11
Mcu.Pin13=PB0
Mcu.Pin14=PB1
Mcu.Pin19=PB14
SH.S_TIM3_CH1.ConfNb=1
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB12
RCC.HSI_VALUE=16000000
Mcu.Pin18=PB13
SH.S_TIM3_CH4.ConfNb=1
Mcu.Pin11=PC4
TIM3.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
Mcu.Pin12=PC5
Mcu.Pin10=PA7
PA2.Mode=Asynchronous
PB8.Signal=GPIO_Output
RCC.PWRFreq_Value=24000000
RCC.APB1Freq_Value=24000000
USART2.Mode=MODE_RX
PB0.Signal=S_TIM3_CH3
ProjectManager.DeviceId=STM32L071RBTx
PB12.GPIOParameters=GPIO_Label
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
SH.S_TIM3_CH4.0=TIM3_CH4,PWM Generation4 CH4
PA7.Signal=S_TIM3_CH2
PA6.Locked=true
isbadioc=false
